jpnorair/OpenTag/include/board/stm32l0xx/charon_r1_todo.h
// These are defined at FULL SPEED
#define BOARD_PARAM_AHBCLKDIV           1                       // AHB Clk = Main CLK / AHBCLKDIV
#define BOARD_PARAM_APB2CLKDIV          1                       // APB2 Clk = Main CLK / AHBCLKDIV
#define BOARD_PARAM_APB1CLKDIV          1                       // APB1 Clk = Main CLK / AHBCLKDIV

// SWD Interface: Nucleo used SWD in all cases, never JTAG.
// The SWO (Trace) pin is available, but not often used.
#define BOARD_SWDIO_PORT                GPIOA
#define BOARD_SWDIO_PINNUM              13
#define BOARD_SWDIO_PIN                 (1<<13)
#define BOARD_SWDCLK_PORT               GPIOA
#define BOARD_SWDCLK_PINNUM             14
#define BOARD_SWDCLK_PIN                (1<<14)
#define BOARD_TRACESWO_PORTNUM          1
#define BOARD_TRACESWO_PORT             GPIOB
#define BOARD_TRACESWO_PINNUM           (1<<3)
#define BOARD_TRACESWO_PIN              3


// ADC Analog inputs on PA0,PA1,PA4,PB0,PC1,PC0 or "A0,A1,A2,A3,A4,A5"
#define BOARD_ADC_PINS                  1
#define BOARD_ADC_PORTS                 1
#define BOARD_ADC_0_PORTNUM             0
#define BOARD_ADC_0_PORT                GPIOA
#define BOARD_ADC_0_CHAN                1
#define BOARD_ADC_0_PINNUM              1
#define BOARD_ADC_0_PIN                 (1<<BOARD_ADC_0PINNUM)
#define BOARD_ADC_0E                    ENABLED
#define BOARD_ADC_0E_PORTNUM            0
#define BOARD_ADC_0E_PORT               GPIOA
#define BOARD_ADC_0E_PINNUM             2
#define BOARD_ADC_0E_PIN                (1<<BOARD_ADC_0E_PINNUM)
#define BOARD_ADC_0E_OTYPE              (GPIO_OTYPE_OPENDRAIN)      //OPEN DRAIN
#define BOARD_ADC_0E_POLARITY           0                           //ACTIVE LOW
#define BOARD_ADC_0_ENABLE()            (BOARD_ADC_0E_PORT->BSRR = (BOARD_ADC_0E_PIN<<16))
#define BOARD_ADC_0_DISABLE()           (BOARD_ADC_0E_PORT->BSRR = BOARD_ADC_0E_PIN)


// SW1 is on PB8, which is also the IFRES pin used to reset the I/O Interface.
// IFRES is active-low with a pullup.
//#define BOARD_SW1_PORTNUM               1
//#define BOARD_SW1_PORT                  GPIOB
//#define BOARD_SW1_PINNUM                8
//#define BOARD_SW1_PIN                   (BOARD_SW1_PINNUM<<3)
//#define BOARD_SW1_POLARITY              0
//#define BOARD_SW1_PULLING               1
//#define BOARD_IFRES_PORTNUM             BOARD_SW1_PORTNUM
//#define BOARD_IFRES_PORT                BOARD_SW1_PORT
//#define BOARD_IFRES_PINNUM              BOARD_SW1_PINNUM
//#define BOARD_IFRES_PIN                 BOARD_SW1_PIN
//#define BOARD_IFRES_POLARITY            BOARD_SW1_POLARITY
//#define BOARD_IFRES_PULLING             BOARD_SW1_PULLING


// SPI Interface on PB3,4,5 and PA15
#define BOARD_SPI_ID                    1        //SPI1
#define BOARD_SPI_PORTNUM               1        //Port B
#define BOARD_SPI_PORT                  GPIOB    
#define BOARD_SPI_MOSIPINNUM            5
#define BOARD_SPI_MISOPINNUM            4
#define BOARD_SPI_SCLKPINNUM            3
#define BOARD_SPI_CSNPORTNUM            0        //Port A
#define BOARD_SPI_CSNPORT               GPIOA
#define BOARD_SPI_CSNPINNUM             15
#define BOARD_SPI_MOSIPIN               (1<<BOARD_SPI_MOSIPINNUM)
#define BOARD_SPI_MISOPIN               (1<<BOARD_SPI_MISOPINNUM)
#define BOARD_SPI_SCLKPIN               (1<<BOARD_SPI_SCLKPINNUM)
#define BOARD_SPI_CSNPIN                (1<<BOARD_SPI_CSNPINNUM)

// TEST0, TEST1 pins are shared with SPI
// They are also connected to the LEDs
#define BOARD_TEST0_PORTNUM             BOARD_SPI_PORTNUM 
#define BOARD_TEST0_PORT                BOARD_SPI_PORT
#define BOARD_TEST0_PINNUM              BOARD_SPI_MOSIPINNUM
#define BOARD_TEST0_PIN                 BOARD_SPI_MOSIPIN
#define BOARD_TEST0_POLARITY            1
#define BOARD_TEST0_PULLING             0
#define BOARD_TEST1_PORTNUM             BOARD_SPI_CSNPORTNUM
#define BOARD_TEST1_PORT                BOARD_SPI_CSNPORT
#define BOARD_TEST1_PINNUM              BOARD_SPI_CSNPINNUM
#define BOARD_TEST1_PIN                 BOARD_SPI_CSNPIN
#define BOARD_TEST1_POLARITY            1
#define BOARD_TEST1_PULLING             0
#define BOARD_LEDG_PORTNUM              BOARD_TEST0_PORTNUM
#define BOARD_LEDG_PORT                 BOARD_TEST0_PORT
#define BOARD_LEDG_PINNUM               BOARD_TEST0_PINNUM
#define BOARD_LEDG_PIN                  BOARD_TEST0_PIN
#define BOARD_LEDG_POLARITY             BOARD_TEST0_POLARITY
#define BOARD_LEDO_PORTNUM              BOARD_TEST1_PORTNUM
#define BOARD_LEDO_PORT                 BOARD_TEST1_PORT
#define BOARD_LEDO_PINNUM               BOARD_TEST1_PINNUM
#define BOARD_LEDO_PIN                  BOARD_TEST1_PIN
#define BOARD_LEDO_POLARITY             BOARD_TEST1_POLARITY


// Main serial connections, used at least by MPIPE

// I2C on PB6/PB7 
//#define BOARD_I2C_PORTNUM               1                       
//#define BOARD_I2C_PORT                  GPIOB
//#define BOARD_I2C_ID                    1
//#define BOARD_I2C_SCLPINNUM             6
//#define BOARD_I2C_SDAPINNUM             7
//#define BOARD_I2C_SCLPIN                (1<<BOARD_I2C_SCLPINNUM)
//#define BOARD_I2C_SDAPIN                (1<<BOARD_I2C_SDAPINNUM)

// UART on PB6/PB7
//#define BOARD_UART_PORTNUM          1
//#define BOARD_UART_PORT             GPIOB
//#define BOARD_UART_ID               1
//#define BOARD_UART_TXPINNUM         6
//#define BOARD_UART_RXPINNUM         7
//#define BOARD_UART_TXPIN            (1<<BOARD_UART_TXPINNUM)
//#define BOARD_UART_RXPIN            (1<<BOARD_UART_RXPINNUM)

// USB is always on PA11/A12
#define BOARD_USB_PORTNUM               0
#define BOARD_USB_PORT                  GPIOA
#define BOARD_USB_DMPINNUM              11
#define BOARD_USB_DPPINNUM              12
#define BOARD_USB_DMPIN                 (1<<BOARD_USB_DMPINNUM)
#define BOARD_USB_DPPIN                 (1<<BOARD_USB_DPPINNUM)







/** BOARD Macros (most of them, anyway) <BR>
  * ========================================================================<BR>
  * BOARD Macros are required by the OpenTag STM32L platform implementation.
  * We can assume certain things at the platform level, but not everything,
  * which is why BOARD Macros are required.
  *
  * If your board is implementing a radio (extremely likely), there are likely
  * some additional Board macros down near the radio configuration section.
  */


// AES Engine is only on STM32L06x
#define _CRYPCLK_N      0   //RCC_AHBENR_CRYPEN
#define _CRYPCLK_LP     0   //RCC_AHBSMENR_CRYPSMEN

// Random Number Generator is used by OpenTag, but only on-demand.  The driver
// must manage the clock bit
#define _RNGCLK_N       RCC_AHBENR_RNGEN
#define _RNGCLK_LP      RCC_AHBSMENR_RNGSMEN

// Touchscreen controller is not used by OpenTag, so the driver must manage it
// on-demand
#define _TOUCHCLK_N     0   //RCC_AHBENR_TOUCHEN
#define _TOUCHCLK_LP    RCC_AHBSMENR_TSCSMEN

//The built-in CRC engine is used by Opentag for many things, but never in sleep
#define _CRCCLK_N        RCC_AHBENR_CRCEN
#define _CRCCLK_LP       0       //RCC_AHBSMENR_CRCSMEN

// SRAM should always be clocked during SLEEP
#define _SRAMCLK_LP      RCC_AHBLPENR_SRAMLPEN

