jpnorair/OpenTag/include/board/stm32l0xx/charon_r1_todo.h
// Flash should be enabled while awake and in sleep unless you seriously modify 
// OpenTag to run exclusively from RAM
#define _MIFCLK_N       RCC_AHBENR_MIFEN
#define _MIFCLK_LP      RCC_AHBSMENR_MIFSMEN

// DMA is used in MEMCPY and thus it could be needed at any time during active
// runtime.  So, the active-clock must be enabled permanently.
#if (MCU_CONFIG_MEMCPYDMA)
#   define _DMACLK_N    RCC_AHBENR_DMA1EN
#   define _DMACLK_LP   RCC_AHBSMENR_DMA1SMEN
#else
#   define _DMACLK_N    0
#   define _DMACLK_LP   RCC_AHBSMENR_DMA1SMEN
#   define _DMACLK_DYNAMIC
#endif

// This board enabled all GPIO on ports A, B, C, and D.
// On startup (_SU), port H is also enabled
#define _GPIOCLK_N       (RCC_IOPENR_GPIOAEN | RCC_IOPENR_GPIOBEN)
#define _GPIOCLK_SU      (_GPIOCLK_N)
#define _GPIOCLK_LP      (_GPIOCLK_N)


#define _IOPENR_STARTUP  (_DMACLK_N | _MIFCLK_N | _CRCCLK_N | _GPIOCLK_SU)
#define _IOPENR_RUNTIME  (_CRYPCLK_N | _MIFCLK_N | _CRCCLK_N | _GPIOCLK_N)


//@note BOARD Macro for Peripheral Clock initialization at startup
static inline void BOARD_PERIPH_INIT(void) {
    // 1. AHB Clock Setup for Active Mode & Sleep
    RCC->AHBENR     = (_CRYPCLK_N | _RNGCLK_N | _TOUCHCLK_N | _CRCCLK_N | _MIFCLK_N | _DMACLK_N);
    RCC->AHBSMENR   = (_CRYPCLK_LP| _RNGCLK_LP| _TOUCHCLK_LP| _CRCCLK_LP| _MIFCLK_LP| _DMACLK_LP);

    // 2. I/O Clock Setup for Sleep and Startup
    RCC->IOPENR     = _IOPENR_STARTUP;

    // 3. APB2 Clocks in Active Mode.  APB2 is the high-speed peripheral bus.  
    // The default is all-off, and it is the job of the peripheral drivers to 
    // enable/disable their clocks as needed.  SYSCFG and Debug Module are on
    // without needing driver support
#   if defined(__DEBUG__) || defined(__PROTO__)
    RCC->APB2ENR   = (RCC_APB2ENR_DBGMCUEN | RCC_APB2ENR_SYSCFGEN);
#   else
    RCC->APB2ENR   = (RCC_APB2ENR_SYSCFGEN);
#   endif

    // 3. APB1 Clocks in Active Mode.  APB1 is the low-speed peripheral bus.
    // The default is all-off, and it is the job of the peripheral drivers to 
    // enable/disable their clocks as needed.  The exceptions are LPTIM1 and 
    // PWR, which are fundamental to OpenTag.
    RCC->APB1ENR   = (RCC_APB1ENR_LPTIM1EN | RCC_APB1ENR_PWREN); 
}



//@note BOARD Macro for DMA peripheral enabling
static inline void BOARD_DMA_CLKON(void) {
#ifdef _DMACLK_DYNAMIC
    RCC->AHBENR    |= RCC_AHBENR_DMA1EN;
#endif
}

static inline void BOARD_DMA_CLKOFF(void) {
#ifdef _DMACLK_DYNAMIC
    RCC->AHBENR    &= ~RCC_AHBENR_DMA1EN;
#endif
}



///@note BOARD Macro for EXTI initialization.  See also EXTI macros at the
///      bottom of the page.
static inline void BOARD_EXTI_STARTUP(void) {
    // EXTI0-3: Unused
    SYSCFG->EXTICR[0]   = 0;
    
    // EXTI4-7: Unused
    SYSCFG->EXTICR[1]   = 0;
    
    // EXTI8-11: Unused
    SYSCFG->EXTICR[2]   = 0;
    
    // EXTI12-15: Unused
    SYSCFG->EXTICR[3]   = 0;
}



///@note BOARD Macro for initializing GPIO ports at startup, pursuant to the
///      connections in the schematic of this board.  This funciotn
static inline void BOARD_PORT_STARTUP(void) {  
    /// Initialize ports/pins exclusively used within this platform module.
    /// A. Trigger Pins
    /// B. Random Number ADC pins: A Zener can be used to generate noise.
    
    /// Configure Port A IO.  
    /// Port A is used for internal features and .
    // - A0 is unused, set to ANALOG (default)
    // - A1 is the ADC_0 input 
    // - A2 is the ADC_0E open drain output (active low, no-pullup)
    // - A3:10 are unused, set to ANALOG (default)
    // - A11:12 are USB I/O, which gets configured in the driver.  Set to HiZ
    // - A13:14 are SWD, set to ALT-DEBUG
    // - A15 is SPI-NSS and TEST1, set to push-pull output
#   ifdef __USE_SPI
    GPIOA->BSRR     = BOARD_SPI_CSNPIN;
#   endif

    GPIOA->MODER    = (GPIO_MODER_ANALOG    << (0*2)) \
                    | (GPIO_MODER_ANALOG    << (1*2)) \
                    | (GPIO_MODER_OUT       << (2*2)) \
                    | (GPIO_MODER_ANALOG    << (3*2)) \
                    | (GPIO_MODER_ANALOG    << (4*2)) \
                    | (GPIO_MODER_ANALOG    << (5*2)) \
                    | (GPIO_MODER_ANALOG    << (6*2)) \
                    | (GPIO_MODER_ANALOG    << (7*2)) \
                    | (GPIO_MODER_ANALOG    << (8*2)) \
                    | (GPIO_MODER_ANALOG    << (9*2)) \
                    | (GPIO_MODER_ANALOG    << (10*2)) \
                    | (GPIO_MODER_ANALOG    << (11*2)) \
                    | (GPIO_MODER_ANALOG    << (12*2)) \
                    | (GPIO_MODER_ALT       << (13*2)) \
                    | (GPIO_MODER_ALT       << (14*2)) \
                    | (GPIO_MODER_IN        << (15*2));

    GPIOA->OTYPER   = (1<<2);
    
    GPIOA->OSPEEDR  = (GPIO_OSPEEDR_40MHz << (11*2)) \
                    | (GPIO_OSPEEDR_40MHz << (12*2)) \
                    | (GPIO_OSPEEDR_40MHz << (13*2)) \
                    | (GPIO_OSPEEDR_40MHz << (14*2));
    
    GPIOA->PUPDR    = 0;

    GPIOA->AFR[1]   = (10 << ((BOARD_USB_DMPINNUM-8)*4)) \
                    | (10 << ((BOARD_USB_DPPINNUM-8)*4));

    /* */

    /// Configure Port B IO.
    /// Port B is used for external (module) IO.
    // - B0:2 are unused and set to Analog mode
    // - B3:5 are SPI pins, which are managed by the driver.  Default=Analog
    // - B6:15 are unused and set to Analog mode
    // - B5 is used as a radio input by default
    // - B6 is used as SPI-CS, an output
    // - B7 is unused and set to Analog mode
    // - B8:9 are setup for I2C bus: They start as output with Open Drain
    // - B10 is a PWM output, set to Analog until configured
    // - B11:15 are unused and set to Analog mode
    GPIOB->OTYPER   = (1 << (8)) | (1 << (9));
    GPIOB->BSRR     = (1 << (8)) | (1 << (9));

    GPIOB->MODER    = (GPIO_MODER_ANALOG << (0*2)) \
                    | (GPIO_MODER_ANALOG << (1*2)) \
                    | (GPIO_MODER_ANALOG << (2*2)) \
                    | (GPIO_MODER_ANALOG << (3*2)) \
                    | (GPIO_MODER_ANALOG << (4*2)) \
                    | (GPIO_MODER_ANALOG << (5*2)) \
                    | (GPIO_MODER_ANALOG << (6*2)) \
                    | (GPIO_MODER_ANALOG << (7*2)) \
                    | (GPIO_MODER_ANALOG << (8*2)) \
                    | (GPIO_MODER_ANALOG << (9*2)) \
                    | (GPIO_MODER_ANALOG << (10*2)) \
                    | (GPIO_MODER_ANALOG << (11*2)) \
                    | (GPIO_MODER_ANALOG << (12*2)) \
                    | (GPIO_MODER_ANALOG << (13*2)) \
                    | (GPIO_MODER_ANALOG << (14*2)) \
                    | (GPIO_MODER_ANALOG << (15*2));
    
    GPIOB->OSPEEDR  = (GPIO_OSPEEDR_10MHz << (3*2)) \
                    | (GPIO_OSPEEDR_10MHz << (4*2)) \
                    | (GPIO_OSPEEDR_10MHz << (5*2));
    
#   if defined(__USE_SPI)
    GPIOB->AFR[0]   = (5 << ((BOARD_SPI_MOSIPINNUM)*4)) \
                    | (5 << ((BOARD_SPI_MISOPINNUM)*4)) \
                    | (5 << ((BOARD_SPI_SCLKPINNUM)*4));
#   endif


    
    
    /// Configure Port C IO.
    /// Port C is unused
    
    // - C14:15 are 32kHz crystal driving, but there is no crystal
    GPIOC->MODER    = (GPIO_MODER_ANALOG << (14*2)) \
                    | (GPIO_MODER_ANALOG << (15*2));
    
    // Disable GPIOC and GPIOH, they are never altered after this.
    RCC->IOPENR = _IOPENR_RUNTIME;
}





static inline void BOARD_SPI_CLKON(void) {
#ifdef __USE_SPI
    BOARD_SPI_PORT->MODER &= ~((3 << (BOARD_SPI_SCLKPINNUM*2)) \
                            | (3 << (BOARD_SPI_MISOPINNUM*2)) \
                            | (3 << (BOARD_SPI_MOSIPINNUM*2)) );
    
    BOARD_SPI_PORT->MODER |= (GPIO_MODER_ALT << (BOARD_SPI_SCLKPINNUM*2)) \
                            | (GPIO_MODER_ALT << (BOARD_SPI_MISOPINNUM*2)) \
                            | (GPIO_MODER_ALT << (BOARD_SPI_MOSIPINNUM*2));
    
