jpnorair/OpenTag/include/board/stm32l0xx/charon_r1_todo.h
  //BOARD_SPI_PORT->MODER ^= (3 << (BOARD_SPI_SCLKPINNUM*2)) \
                            | (2 << (BOARD_SPI_MISOPINNUM*2)) \
                            | (3 << (BOARD_SPI_MOSIPINNUM*2));
#endif
}

static inline void BOARD_SPI_CLKOFF(void) {
#ifdef __USE_SPI
    BOARD_SPI_PORT->MODER &= ~((3 << (BOARD_SPI_SCLKPINNUM*2)) \
                            | (3 << (BOARD_SPI_MISOPINNUM*2)) \
                            | (3 << (BOARD_SPI_MOSIPINNUM*2)) );
    
    BOARD_SPI_PORT->MODER |= (GPIO_MODER_OUT << (BOARD_SPI_SCLKPINNUM*2)) \
                            | (GPIO_MODER_IN << (BOARD_SPI_MISOPINNUM*2)) \
                            | (GPIO_MODER_OUT << (BOARD_SPI_MOSIPINNUM*2));
    
  //BOARD_SPI_PORT->MODER ^= (3 << (BOARD_SPI_SCLKPINNUM*2)) \
                            | (2 << (BOARD_SPI_MISOPINNUM*2)) \
                            | (3 << (BOARD_SPI_MOSIPINNUM*2));
#endif
}



#include <platform/timers.h>    // for systim_stop_clocker()
static inline void BOARD_STOP(ot_int code) {
/// code comes from sys_sig_powerdown, but it is usually 0-3.
/// For all STM32L devices, 3 is full-idle and 2 is radio-active-idle.  
/// Those are the only modes that should call this inline function.

    static const ot_u16 stop_flags[2] = {  
        (PWR_CR_LPSDSR | PWR_CR_CSBF), (PWR_CR_LPSDSR | PWR_CR_FWU | PWR_CR_ULP | PWR_CR_CSBF) };
        
    static const ot_u32 rcc_flags[2] = {
        (RCC_IOPENR_GPIOAEN | RCC_IOPENR_GPIOBEN), 0 };
        
    static const ot_u32 b_moder[2] = {
        0xFFFFFC0, 0xFFFFFFFF };
    
    ot_u16 scratch;
    
    code &= 1;
    
#   if defined(__RELEASE__)
      //GPIOA->MODER    = 0xFFFFFFFF;
      //GPIOB->MODER    = b_moder[code];
      //GPIOA->PUPDR    = 0;
      //GPIOB->PUPDR    = 0;      //can be ignored, always 0
      RCC->IOPENR    &= rcc_flags[code];
#   endif

    SysTick->CTRL = 0;
    SCB->SCR   |= SCB_SCR_SLEEPDEEP_Msk;
    scratch     = PWR->CR;
    scratch    &= ~(PWR_CR_DBP | PWR_CR_PDDS | PWR_CR_LPSDSR);
    scratch    |= stop_flags[code];
    PWR->CR     = scratch;
    
    EXTI->PR    = 0;
    systim_stop_clocker();
    platform_enable_interrupts();
    
    __WFI();
    
    // On Wakeup (from STOP) clear flags & re-enable backup register area
    PWR->CR |= (PWR_CR_DBP | PWR_CR_CWUF | PWR_CR_CSBF);
    
    // On wakeup, immediately reset SLEEPDEEP bit
    SCB->SCR &= ~((ot_u32)SCB_SCR_SLEEPDEEP_Msk);
    
    // Re-enable ports
#   if defined(__RELEASE__)
      RCC->IOPENR    |= _IOPENR_RUNTIME;
      //GPIOA->PUPDR    = GPIOA_PUPDR_DEFAULT;
      //GPIOB->PUPDR    = GPIOB_PUPDR_DEFAULT;    //can be ignored, always 0
      //GPIOA->MODER    = GPIOA_MODER_DEFAULT;
      //GPIOB->MODER    = GPIOB_MODER_DEFAULT;
#   endif
}




static inline void BOARD_PORT_STANDBY() {
///@todo implement this!
}




///@note BOARD Macro for initializing the STM32 PVD Module (voltage monitor) at
///      startup.  Only relevant for battery-powered boards.
static inline void BOARD_POWER_STARTUP(void) {
#   if (MCU_FEATURE_SVMONITOR == ENABLED)
    // Level0 is 1.9V, each level is +0.2V.  Check your battery spec and change
    // the _LEVx component to match it.  Typical Li-Ion undervoltage is 2.7V.
    PWR->CR    |= PWR_CR_PLS_LEV0 | PWR_CR_PVDE;  
#   endif
}



///@note BOARD Macro for initializing the STM32 Crystal startup routine, done
///      at startup.  For any build using CMSIS libraries (standard), this will
///      be blank.  In those cases, crystal init is done in the CMSIS system
///      startup function.
static inline void BOARD_XTAL_STARTUP(void) {
// Currently this is handled in the system startup function.  OpenTag requires
// a 32768Hz clock
}



///@note BOARD Macro for initializing the STM32 Crystal startup routine, done
///      at startup.  For any build using CMSIS libraries (standard), this will
///      be blank.  In those cases, crystal init is done in the CMSIS system
///      startup function.

static inline void BOARD_HSXTAL_ON(void) {
///@todo turn on high speed oscillator
}

static inline void BOARD_HSXTAL_OFF(void) {
///@todo turn off high speed oscillator
}

static inline void BOARD_USBCLK_ON(void) {
///@todo Use CRS or HSXTAL-on based on configuration.  Then turn on PLL
    // ...
    platform_ext_pllon();
}

static inline void BOARD_USBCLK_OFF(void) {
///@todo deal with CRS or turn-off HSXTAL based on configuration
    platform_ext_plloff();
    // ...
}

static inline void BOARD_USB_PORTENABLE(void) {
    BOARD_USBCLK_ON();
    
    //BOARD_USB_PORT->MODER  |= (GPIO_MODER_ALT << (BOARD_USB_DMPINNUM*2)) \
                            | (GPIO_MODER_ALT << (BOARD_USB_DPPINNUM*2));
    //SYSCFG->PMC |= SYSCFG_PMC_USB_PU;
}

static inline void BOARD_USB_PORTDISABLE(void) {
    //SYSCFG->PMC &= ~SYSCFG_PMC_USB_PU;
    //BOARD_USB_PORT->MODER  &= ~( (3 << (BOARD_USB_DMPINNUM*2)) \
                               | (3 << (BOARD_USB_DPPINNUM*2)) );
    BOARD_USBCLK_OFF();
}

   

///@note BOARD Macros for Radio module interrupt vectoring.  Connect these to
///      the radio interface driver you are using.  Check the schematic of your
///      board to see where the Radio IRQ lines are routed.  Also check the 
///      radio interface header documentation (it's really quite simple). 
///      These Macros will get called in the universal EXTI interrupt handler,
///      typically implemented in platform_isr_STM32L.c
#define BOARD_RADIO_EXTI0_ISR(); 
#define BOARD_RADIO_EXTI1_ISR();   
#define BOARD_RADIO_EXTI2_ISR();
#define BOARD_RADIO_EXTI3_ISR();
#define BOARD_RADIO_EXTI4_ISR();
#define BOARD_RADIO_EXTI5_ISR();
#define BOARD_RADIO_EXTI6_ISR();     
#define BOARD_RADIO_EXTI7_ISR();     
#define BOARD_RADIO_EXTI8_ISR();
#define BOARD_RADIO_EXTI9_ISR();
#define BOARD_RADIO_EXTI10_ISR();
#define BOARD_RADIO_EXTI11_ISR();
#define BOARD_RADIO_EXTI12_ISR();
#define BOARD_RADIO_EXTI13_ISR();
#define BOARD_RADIO_EXTI14_ISR();
#define BOARD_RADIO_EXTI15_ISR();


///@todo Create a more intelligent setup that knows how to use the UART, even
///      though for this board UART is not generally the MPipe
///@note BOARD Macros for Com module interrupt vectoring.  Connect these to
///      the Com interface driver you are using.  Check the schematic of your
///      board to see where the Com IRQ lines are routed. 
#if (MCU_CONFIG(MPIPEUART) && OT_FEATURE(MPIPE) && BOARD_FEATURE(MPIPE) && BOARD_FEATURE(MPIPE_BREAK))
#   define _UART_RXSYNC_ISR()       mpipe_rxsync_isr()
#else
#   define _UART_RXSYNC_ISR()       ;
///@todo implement non-mpipe uart with break feature 
#endif

#define BOARD_UART_EXTI0_ISR();
#define BOARD_UART_EXTI1_ISR();
#define BOARD_UART_EXTI2_ISR();
#define BOARD_UART_EXTI3_ISR();
#define BOARD_UART_EXTI4_ISR();
#define BOARD_UART_EXTI5_ISR();
#define BOARD_UART_EXTI6_ISR();     
#define BOARD_UART_EXTI7_ISR();     
#define BOARD_UART_EXTI8_ISR();     
#define BOARD_UART_EXTI9_ISR();
#define BOARD_UART_EXTI10_ISR();   
#define BOARD_UART_EXTI11_ISR();
#define BOARD_UART_EXTI12_ISR();
#define BOARD_UART_EXTI13_ISR();
#define BOARD_UART_EXTI14_ISR();
#define BOARD_UART_EXTI15_ISR();





/** Note: Clocking for the Board's MCU      <BR>
  * ========================================================================<BR>
  * The STM32L can be clocked up to 32MHz, but generally we use it at 16 MHz.
  * At the 1.5V core setting, 16MHz can be used with 1 flash waitstate, but 
  * OpenTag code tends to abhor branching, so flash wait states have less 
  * affect on OT efficiency than they have on most other codebases.
  */
#define MCU_CONFIG_LFXTALHz          BOARD_PARAM_LFHz
#define MCU_CONFIG_LFXTALtol         BOARD_PARAM_LFtol
//#define MCU_CONFIG_LFOSCHz           BOARD_PARAM_LFHz
//#define MCU_CONFIG_LFOSCtol          BOARD_PARAM_LFtol
//#define MCU_CONFIG_XTALHz            BOARD_PARAM_HFHz
//#define MCU_CONFIG_XTALmult          BOARD_PARAM_HFmult
//#define MCU_CONFIG_XTALtol           BOARD_PARAM_HFtol
#define MCU_CONFIG_OSCHz             BOARD_PARAM_HFHz
#define MCU_CONFIG_OSCmult           BOARD_PARAM_HFmult
#define MCU_CONFIG_OSCtol            BOARD_PARAM_HFtol

#define PLATFORM_MCLK_DIV           BOARD_PARAM_MCLKDIV
#define PLATFORM_SMCLK_DIV          BOARD_PARAM_SMCLKDIV

